<!DOCTYPE html>
<html lang="fr">
<head>
<meta charset="utf-8">
<title>Pr&eacute;sentation de Guillaume Cr&eacute;gut</title>
<style type="text/css">
body {
	background-image:url(fond.jpg);
}
p {
	margin : 7px;
}
#image{
	margin : auto;
	display : block;
}
h1{
	text-align : center;
}
li{
	color : blue;
	list-style-image : url(fleche.png);
	margin : 15px;
}
h2 {
text-decoration : underline;
}
</style>
<script>
function clickmoi()
{
	alert("Et surtout j'aime le fait d'apprendre et maitriser les nouvelles technologies");
}
</script>
</head>
<body>
<h1>Pr&eacute;sentation</h1>
<h2>Qui suis-je ?</h2>
<p><img id="image" src="photo.png" width="201" height="202" alt="ma photo" /></p>
<p>Bonjour, je m'appelle Guillaume Cr&eacute;gut, 41 ans maintenant.<br>
j'ai commenc&eacute; avec un BTS en &eacute;lectronique, avec une pr&eacute;f&eacute;rence pour les micro controleurs et l'&eacute;lctronique logique. Naturellement, cela m'a amener dans le monde de la programmation, d'abord en assembleur, puis en C, C++.<br>
Par la suite, j'ai choisi &agrave; titre personnel de me former dans un language plus visuel pour la conception d'applications, en apprenant le pascal objet avec l'environnement Delphi.</p>
<p>Dans mon parcours professionnel, j'ai &eacute;t&eacute; amen&eacute; à développer quelques applications pour le fonctionnement interne de l'entreprise, en parall&egrave;le, je travaillais dans un univers o&ugrave; le r&eacute;seau, et les mat&eacute;riels informatique &eacute;taient mon quotidien.</p>
<p>Plus tard, pour g&eacute;rer mon activit&eacute; (<a href="http://editiel98.net/" target="_blank">Editiel98</a>), j'ai d&eacute;velopp&eacute; les outils qui m'&eacute;taient n&eacute;cessaire, et qui correspondait &agrave; mes besoins. Le choix s'est port&eacute; sur le php car plus simple de maintenance, libre de licence et mulitplateforme.</p>
<p>Depuis mon retour &agrave; l'emploi de salari&eacute;, j'ai retrouv&eacute; le monde mixte de l'&eacute;lectronique et de l'informatique, mais je suis limit&eacute; dans mes possibilit&eacute; de developpement, principalement bases sur des bases de donn&eacute;es.</p>
<p>J'ai cependant garder ma passion pour la cr&eacute;ation de syst&egrave;me combin&eacute; (&eacute;lectronique et informatique), et je travaille sur plusieurs projets personnels (gestion de ruchers, gestion de cave personnelle, domotique entre autre).
Je ne suis pas le plus dou&eacute; pour cr&eacute;er des syst&egrave;mes esth&eacute;tiquement beaux, cherchant beaucoup plus la simplicit&eacute;, la robustesse et la facilit&eacute; de l'utilisation.</p>
<p>Vous pouvez me trouver sur les r&eacute;seaux sociaux tel <a href="https://www.linkedin.com/in/guillaumecregut/" target="_blank">LinkedIn</a> ou bien <a href="http://fr.viadeo.com/fr/profile/guillaume.cregut" target="_blank">viadeo</a>.</p>
<h2>Mes loisirs</h2>
<p>En dehors de la technologie, voici quelque un de mes loisirs :
<ul>
<li>je suis amateur de travail sur bois (tournage, menuiserie, <a href="http://www.passion-copeaux.net/index.php" target="blank">voir mon site</a>) 
<iframe width="640" height="360" src="https://www.youtube.com/embed/F4tiSJvWIs8?list=PLEpVlAQQWlb-AD2Gd5-HX5-6696W6GIxc" frameborder="0" allow="autoplay; encrypted-media" allowfullscreen></iframe></li>
<li>La musique, notamment avec l'apprentissage de la guitare.</li>
<li>L'histoire de l'aviation, notamment les avions de combats jusqu'&agrave; la seconde guerre mondiale<br>
<img src="http://bf109.chambres-antiques.net/autres/images/p51e1.jpg" alt="P51" /><br><img src="http://bf109.chambres-antiques.net/images/bf109s1.jpg" alt="messerschmitt 109" /><br> photos tir&eacute;es de <a href="http://bf109.chambres-antiques.net/" target="_blanck">mon site</a>.</li>
<li>Il y a aussi la litt&eacute;rature et la photo</li>
</ul>
<h2>Pourquoi choisir le developpement web ?</h2>
<p>J'ai commenc&eacute; &agrave; &eacute;crire des pages web au d&eacute;but des ann&eacute;es 2000, et avec mon apprentissage de php, j'ai d&eacute;couvert un environnement de developpement souple, multi plateforme et avec une certaine facilit&eacute; de maintenance et d'&eacute;volution.<br>
Cependant, ma plus grande force, mais aussi ma faiblesse est d'&ecirc;tre autodidacte, donc l'envie d'apprendre ne me g&egrave;ne pas, mais me ralenti dans mes projets par manque de connaissance au moment n&eacute;cessaire.C'est donc la raison qui m'a pouss&eacute; &agrave; vouloir suivre la formation afin d'&ecirc;tre plus efficace, acqu&eacute;rir une m&eacute;thode de travail professionnelle et une autonomie plus importante dans ce travail.</p>
<p>De plus j'appr&eacute;cie beaucoup le fait de concevoir, et d'utiliser un syst&egrave;me depuis l'approche du cahier des charges jusqu'&agrave; la livraison de celui-ci. <input type="button" value="En savoir plus" onclick="clickmoi()"</p>
</body>
</html>

